---

author: Юрій Клебан

---

# Binding rows and columns

Before start load packages

In [12]:
library(dplyr) # for demos
#install.packages("gapminder")
library(gapminder)  # load package and dataset

## `bind_rows`

`bind_rows(.data, …)` helps to unite two dataframes with the same columns order and names.

So, if we need add one data frame to an other vertically (bind rows) we shoul use `bind_rows`:

In [9]:
d2002 <- gapminder %>%
            filter(year == 2002) %>% # year
            group_by(continent, year) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n(), # n() count of rows in group 
                .groups = 'drop'
            )
head(d2002)

  continent year lifeExpAvg countriesCount
1 Africa    2002 53.32523   52
2 Americas  2002 72.42204   25
3 Asia      2002 69.23388   33
4 Europe    2002 76.70060   30
5 Oceania   2002 79.74000    2

In [10]:
d2007 <- gapminder %>%
            filter(year == 2007) %>% # year
            group_by(continent, year) %>% # grouping condition
            summarise(
                lifeExpAvg = mean(lifeExp),
                countriesCount = n() # n() count of rows in group                
            )
head(d2007)

`summarise()` has grouped output by 'continent'. You can override using the `.groups` argument.

  continent year lifeExpAvg countriesCount
1 Africa    2007 54.80604   52
2 Americas  2007 73.60812   25
3 Asia      2007 70.72848   33
4 Europe    2007 77.64860   30
5 Oceania   2007 80.71950    2

Unite them:

In [13]:
d2002 %>% bind_rows(d2007) ## bind rows

   continent year lifeExpAvg countriesCount
1  Africa    2002 53.32523   52
2  Americas  2002 72.42204   25
3  Asia      2002 69.23388   33
4  Europe    2002 76.70060   30
5  Oceania   2002 79.74000    2
6  Africa    2007 54.80604   52
7  Americas  2007 73.60812   25
8  Asia      2007 70.72848   33
9  Europe    2007 77.64860   30
10 Oceania   2007 80.71950    2

---

## `bind_cols`

`bind_cols(.data, …)` helps to unite two dataframes with the same rows count.

In [14]:
grouped_data2002pop <- gapminder %>%
    filter(year == 2002) %>% # year
    group_by(continent) %>% # grouping condition
    summarise(totalPop = sum(pop)) %>%
    mutate(year = 2002)
grouped_data2002pop

  continent totalPop   year
1 Africa     833723916 2002
2 Americas   849772762 2002
3 Asia      3601802203 2002
4 Europe     578223869 2002
5 Oceania     23454829 2002

Let's combine `d2002` and `grouped_data2002pop`:

In [15]:
grouped_data <- d2002 %>% 
    bind_cols(grouped_data2002pop)
grouped_data

# columns with the same name were renamed!

New names:
* `continent` -> `continent...1`
* `year` -> `year...2`
* `continent` -> `continent...5`
* `year` -> `year...7`

  continent...1 year...2 lifeExpAvg countriesCount continent...5 totalPop
1 Africa        2002     53.32523   52             Africa         833723916
2 Americas      2002     72.42204   25             Americas       849772762
3 Asia          2002     69.23388   33             Asia          3601802203
4 Europe        2002     76.70060   30             Europe         578223869
5 Oceania       2002     79.74000    2             Oceania         23454829
  year...7
1 2002
2 2002
3 2002
4 2002
5 2002

You can remove same named variables before binding:

In [18]:
grouped_data <- d2002 %>% 
    bind_cols(grouped_data2002pop %>%
              select(-continent, -year))
grouped_data

# better, but continents order is not the same in both frames 
# your data is going to be damaged

  continent year lifeExpAvg countriesCount totalPop
1 Africa    2002 53.32523   52              833723916
2 Americas  2002 72.42204   25              849772762
3 Asia      2002 69.23388   33             3601802203
4 Europe    2002 76.70060   30              578223869
5 Oceania   2002 79.74000    2               23454829

In [20]:
grouped_data2002pop <- grouped_data2002pop %>% 
    arrange(totalPop)

grouped_data <- d2002 %>% 
    bind_cols(grouped_data2002pop)
grouped_data

# you can see that continent fields different in the same row

New names:
* `continent` -> `continent...1`
* `year` -> `year...2`
* `continent` -> `continent...5`
* `year` -> `year...7`

  continent...1 year...2 lifeExpAvg countriesCount continent...5 totalPop
1 Africa        2002     53.32523   52             Oceania         23454829
2 Americas      2002     72.42204   25             Europe         578223869
3 Asia          2002     69.23388   33             Africa         833723916
4 Europe        2002     76.70060   30             Americas       849772762
5 Oceania       2002     79.74000    2             Asia          3601802203
  year...7
1 2002
2 2002
3 2002
4 2002
5 2002

How to solve this? **`Join`** functions issolution.

---

## Refences

1. [dplyr: A Grammar of Data Manipulation](https://cran.r-project.org/web/packages/dplyr/index.html) on https://cran.r-project.org/.
2. [Data Transformation with splyr::cheat sheet](https://github.com/rstudio/cheatsheets/blob/master/data-transformation.pdf).
3. [DPLYR TUTORIAL : DATA MANIPULATION (50 EXAMPLES)](https://www.listendata.com/2016/08/dplyr-tutorial.html) by Deepanshu Bhalla.
5. [Dplyr Intro](https://stat545.com/dplyr-intro.html) by Stat 545.
6.[R Dplyr Tutorial: Data Manipulation(Join) & Cleaning(Spread)](https://www.guru99.com/r-dplyr-tutorial.html). Introduction to Data Analysis
7. [Loan Default Prediction. Beginners data set for financial analytics Kaggle](https://www.kaggle.com/kmldas/loan-default-prediction)